/*
 * test.c
 *
 *  Created on: Oct 18, 2024
 *      Author: lirongyaoper
 */


#include <stdio.h>
#include <string.h>
#include <assert.h>

//**************************************************************************************
//
int main(){
	const char * p = "hello world";
	printf("%s\n",p);
	printf("%s\n","hello world");
	int lenstr = strlen(p);
	int i = 0;
	for(i = 0; i < lenstr; i++){
		printf("%c" ,*(p+i));
	}

	return 0;
}
//**************************************************************************************
//int main(){
//	char arr[] = "abcdefg";
//	printf("%s\n", arr);//提供字符串的首地址，打印字符串
//	char* p = arr;
//	printf("%s" ,p);
//	return 0;
//
//}
//***********************************数组指针变量***************************************************
//类比：
//	字符指针：  char* p  指向字符的指针，存放的是字符的地址  char ch = "W";  char* pc = &ch;
//	整型指针：  int* p   指向整型的指针，存放的是整形的地址  int n = 10; int* p = &n;
//	数组指针：              指向数组的指针，存放的是数组的地址


//---------数组知识回顾-
//	int arr[10];
//	arr;  数组名是数组首元素的地址；
//	&arr[0]  也表示数组首元素的地址；
//	&arr  取出的是整个数组的地址；
//	sizeof(arr)  也是取出整个数组的地址；

//--------数组指针的表示格式------------------
//int main(){
//	int arr[10]={0};
//	int (*p)[10] = &arr; //p是数组指针，p指向的是数组，数组里有10个元素，每个元素的类型是int
//	//int *p[10]  指针数组
//	return 0;
//}

///********************************************练习1****************************************************

//int main(){
//	char arr[5];
//	char (*p)[5] = &arr;
//	//char (*)[5]  是该数组指针的类型
// 	return 0;
//}
/////********************************************练习2****************************************************
//int main(){
//	char* arr[5];//指针数组
//	char* (*p)[5] = &arr; //数组指针 不能省略[] 里面的数字
//	// char* (*)[5]  是该数组指针的类型
//	return 0;
//}


		//	int (*p) [10] =&a
		//	 |    |   |
		// 	 |	  |   |
		//	 |    |   p指向数组的元素个数
		// 	 |    p是数组指针变量名
		//	 |p指向的数组内元素的类型
///********************************数组指针的应用****************************************************************
// int main(){
//	 int arr[10] ={1,2,3,4,5,6,7,8,9,10};
//	 int * p = arr;
//	 int i = 0;
//	 int sz = sizeof(arr)/sizeof(arr[0]);
//	 for(i = 0;i < sz;i++){
//		 printf("%d ",*(p+i));
//	 }
//	 return 0;
// }


// int main(){
//	 int arr[10] ={1,2,3,4,5,6,7,8,9,10};
//	 int (*p)[10] = &arr;
//	 int i = 0;
//	 int sz = sizeof(arr)/sizeof(arr[0]);
//	 for(i = 0;i < sz;i++){
//		 printf("%d ",*(*p+i));//*p 等价于*&arr，即 *p=arr  即为数组首元素的地址
//		 //printf("%d ",(*p)[i]);
//	 }
//	 return 0;
// }

 //**********************END *******主要辨别以上两个p的类型及用法**********************************************************

//**********************BEGIN******* 数组指针与二维数组*********************************************************
//void test_01(int arr[3][5],int r,int c){
//	int i=0; int j = 0;
//	for(i =0;i < r; i++){
//		for(j = 0; j < c; j++){
//			printf("%d ",arr[i][j]);
//		}
//	}
//}
//int main(){
//	int arr[3][5]={{1,2,3,4,5},{11,22,33,44,55},{111,222,333,444,555}};
//	test_01(arr,3,5);
//	return 0;
//}



//************************BEGIN**************************************

//二维数组的数组名是 下标为零的一维数组的地址。
//void test_01(int(*p)[5],int r,int c){
//	int i=0;int j = 0;
//	for(i =0;i < r; i++){
//		for(j = 0;j < c; j++){
//			//printf("%d ",(*(p+i))[j]); //难点 重点
//			printf("%d ",*(*(p+i)+j));//重点 难点
//		}
//	}
//}
//int main(){
//	int arr[3][5]={{1,2,3,4,5},{11,22,33,44,55},{111,222,333,444,555}};
//	test_01(arr,3,5);
//	return 0;
//}
//************************END**************************************










