#define _CRT_SECURE_NO_EARNINGS 1
/*
 * Wild_pointer.c
 *
 *  Created on: Sep 24, 2024
 *      Author: lirongyaoper
 */

/*
 * Wild_pointer.c
 *  野指针成因：
 *  1.指针变量未初始化
*   2.指针越界
*   3.指针所指的空间不存在
*
*
 *    Author: lirongyaoper
 */

#include <stdio.h>
//********************************************************************
//int main(){
//	int a;
//	printf("%d\n" ,a);
//	return 0;
//}
//*****************1.指针变量未初始化***********************************
//int main(){
//	int* pa;//野指针
//	*pa = 20;
//	printf("%d\n" ,*pa);
//	return 0;
//}

//*****************2.指针越界**********************************
//int main(){
//	int arr[10] = {0};
//	int* p  = &arr[0];
//	int i = 0;
//	for(i = 0; i <=11; i++){
//		*(p+1) = i;  //当指针指向的范围超出数组arr的范围时，p就是野指针
//	}
//
//	return 0;
//}
//**************3. 指针指向的空间释放******************************
//int* test(){
//	int n = 800;
//	return &n;
//}
//
//int main(){
//	int* p = test();
//	*p = 1000;
//	return 0;
//}
//********************************************************************



